FirstRoutes/app/controllers/artworks_controller.rb

INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "flying pizza"], ["image_url", "hellokinda.com"], ["artist_id", 8], ["created_at", "2018-09-11 00:08:51.977373"], ["updated_at", "2018-09-11 00:08:51.977373"]]
---
  def create
    artwork = Artwork.new(clean_params)
    if artwork.save

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "artworks" SET "artist_id" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["artist_id", 7], ["updated_at", "2018-09-11 00:09:49.165131"], ["id", 3]]
---
  def update
    artwork = Artwork.find_by(id: params[:id])
    if artwork.update(clean_params)