FirstRoutes/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "superman"], ["email", "super@man.com"], ["created_at", "2018-09-10 21:56:45.309058"], ["updated_at", "2018-09-10 21:56:45.309058"]]
---
  def create
    user = User.new(clean_params)
    if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "username" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["email", "wonder@woman.com"], ["username", "Wonder_Woman"], ["updated_at", "2018-09-10 22:06:46.277556"], ["id", 6]]
---
  def update
    user = User.find_by(id: params[:id])
    if user.update(clean_params)